MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
/**
 *******************************************************************************
 * @file hc32_hal_smbus.c
 * @brief This file provides firmware functions to manage the SMBus protocol.
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_hal_smbus.h"
#include "hc32_ll_utility.h"
#include "hc32_ll_i2c.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup HAL_SMBus SMBus
 * @brief SMBUS Driver Library
 * @{
 */

#if (HAL_SMBUS_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup HAL_SMBus_Local_Macros HAL SMBus Local Macros
 * @{
 */

#define MAX_NBYTE_SIZE (255U)

/* SMBUS slave transfer interrupt */
#define SMBUS_INT_SLAVE_TX (I2C_INT_TX_CPLT | I2C_INT_NACK)
#define SMBUS_INT_SLAVE_RX (I2C_INT_RX_FULL | I2C_INT_NACK)

#define HAL_SMBUS_STAT_MASTER_SLAVE_MASK (0x000000F7UL)

/* SMBUS address */
#define SMBUS_ADDR_GENERAL_CALL (0x00UL)
#define SMBUS_ADDR_DEFAULT      (0xC2UL >> 1U)
#define SMBUS_ADDR_HOST         (0x10UL >> 1U)
#define SMBUS_ADDR_ARA          (0x18UL >> 1U)

/* Register mask */
#define I2C_CR1_RW_MASK (0x2EUL)
#define I2C_CR2_RW_MASK (0x00F04206UL)

/**
 * @defgroup SMBUS_Com_State_define SMBus Transfer Communication State definition
 * @{
 */

#define SMBUS_I2C_STAT_IDLE    (0x00000001UL) /*!< SMBUS Idle */
#define SMBUS_I2C_STAT_START   (0x00000002UL) /*!< SMBUS Start finished */
#define SMBUS_I2C_STAT_ADDR_TX (0x00000003UL) /*!< SMBUS device address and RW bit send finished */
#define SMBUS_I2C_STAT_TX      (0x00000004UL) /*!< SMBUS data TX stage */
#define SMBUS_I2C_STAT_ADDR_RX (0x00000005UL) /*!< SMBUS device address and RW bit send finished */
#define SMBUS_I2C_STAT_RX      (0x00000006UL) /*!< SMBUS data RX stage */
#define SMBUS_I2C_STAT_RESTART (0x00000007UL) /*!< SMBUS ReStart finished */
#define SMBUS_I2C_STAT_STOP    (0x00000009UL)
/**
 * @}
 */

#if (USE_RTOS == 1U)
#error " USE_RTOS should be 0 in the current HAL release "
#else
#define __HAL_LOCK(__HANDLE__)                  \
    do                                          \
    {                                           \
        if ((__HANDLE__)->u8Lock == HAL_LOCKED) \
        {                                       \
            return HAL_BUSY;                    \
        }                                       \
        else                                    \
        {                                       \
            (__HANDLE__)->u8Lock = HAL_LOCKED;  \
        }                                       \
    } while (0U)

#define __HAL_UNLOCK(__HANDLE__)             \
    do                                       \
    {                                        \
        (__HANDLE__)->u8Lock = HAL_UNLOCKED; \
    } while (0U)
#endif /* USE_RTOS */

/**
 * @defgroup SMBUS_Check_Parameters_Validity SMBUS Check Parameters Validity
 * @{
 */

#define IS_SMBUS_XFER_OPT(x)                                            \
    ((((x) & HAL_SMBUS_FIRST_LAST_FRAME) == HAL_SMBUS_FIRST_LAST_FRAME) \
  || (((x) & HAL_SMBUS_FIRST_LAST_FRAME) == HAL_SMBUS_FIRST_NEXT_FRAME) \
  || (((x) & HAL_SMBUS_FIRST_LAST_FRAME) == HAL_SMBUS_NEXT_LAST_FRAME)  \
  || (((x) & HAL_SMBUS_FIRST_LAST_FRAME) == HAL_SMBUS_NEXT_FRAME))

#define IS_SMBUS_PERIPH_MD(x) (((x) == I2C_SMBUS_MATCH_HOST) || ((x) == I2C_SMBUS_MATCH_DEFAULT))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

static int32_t I2C_BaudInit(CM_I2C_TypeDef *I2Cx, uint32_t u32Baudrate);
static en_flag_status_t I2C_IntStdGet(CM_I2C_TypeDef *I2Cx, uint32_t u32IntType);
static uint32_t I2C_GetAddr(CM_I2C_TypeDef *I2Cx);

static void MasterTansCpltCallback(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterDataFinish(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterStopHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterStartHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterReceiveDataHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterTxEmptyHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void MasterTxCompleteHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void SlaveNackHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void SlaveAddrHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void SlaveTxCompleteHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void SlaveReceiveDataHandler(stc_hal_smbus_handle_t *pHalSmbus);
static void SlaveStopHandler(stc_hal_smbus_handle_t *pHalSmbus);

static int32_t SMBUSMasterISR(stc_hal_smbus_handle_t *pHalSmbus);
static int32_t SMBUSSlaveISR(stc_hal_smbus_handle_t *pHalSmbus);

