MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @brief I2C Event interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
void I2C_EE_IrqHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return;
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_START))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_START)))
    {
        if (    ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_TX)
             || (pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_RX)
        {
            (void)SMBUSMasterISR(pHalSmbus);
        }
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_STOP))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_STOP)))
    {
        if (SMBUS_I2C_STAT_STOP == pHalSmbus->u32ComState)
        {
            (void)SMBUSMasterISR(pHalSmbus);
        }
        else
        {
            (void)SMBUSSlaveISR(pHalSmbus);
        }
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_MATCH_ADDR0))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0)))
    {
        (void)SMBUSSlaveISR(pHalSmbus);
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_NACKF))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_NACK)))
    {
        if (    ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_TX)
             || (pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_RX)
        {
            (void)SMBUSMasterISR(pHalSmbus);
        }
        else
        {
            (void)SMBUSSlaveISR(pHalSmbus);
        }
    }

    if (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_GENERAL_CALL | I2C_FLAG_SMBUS_DEFAULT_MATCH | I2C_FLAG_SMBUS_HOST_MATCH | I2C_FLAG_SMBUS_ALERT_MATCH))
    {
        (void)SMBUSSlaveISR(pHalSmbus);
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_TMOUTF))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_TMOUTIE)))
    {
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_TMOUTF);

        if (pHalSmbus->u32TimeoutCnt++ == pHalSmbus->stcInit.u32SMBusTimeout)
        {
            /* SMBus Timeout */
            pHalSmbus->u32TimeoutCnt = 0U;
            pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_TIMEOUT;

            if (    ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_SLAVE_BUSY_TX)
                 || (pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_SLAVE_BUSY_RX)
            {
                pHalSmbus->u32State = HAL_SMBUS_STAT_LISTEN;
            }

            /* Call the Error callback to inform upper layer */
            HAL_SMBUS_ErrorCallback(pHalSmbus);
        }
    }

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_ARBITRATE_FAIL))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_ARBITRATE_FAIL)))
    {
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_ARBITRATE_FAIL);
        pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_ARLO;

        if (    ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_SLAVE_BUSY_TX)
             || (pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_SLAVE_BUSY_RX)
        {
            pHalSmbus->u32State = HAL_SMBUS_STAT_LISTEN;
        }
        /* Call the Error callback to inform upper layer */
        HAL_SMBUS_ErrorCallback(pHalSmbus);
    }

#ifdef SMBUS_ALERT

    if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_SMBALERT))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_SMBALERT_PIN)))
    {
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_SMBALERT);
        pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_ALERT;
        /* Call the Error callback to inform upper layer */
        HAL_SMBUS_ErrorCallback(pHalSmbus);
    }
#endif
}

/**
 * @brief I2C transfer complete interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
void I2C_TxComplete_IrqHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return;
    }

    if (    ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_TX)
         || ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_RX))
    {
        (void)SMBUSMasterISR(pHalSmbus);
    }
    else
    {
        (void)SMBUSSlaveISR(pHalSmbus);
    }
}

/**
 * @brief I2C transfer empty interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
void I2C_TxEmpty_IrqHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return;
    }

    if ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_TX)
    {
        (void)SMBUSMasterISR(pHalSmbus);
    }
}

/**
 * @brief I2C receive full interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
void I2C_RxFull_IrqHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return;
    }

