MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
    if ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_MASTER_BUSY_RX)
    {
        (void)SMBUSMasterISR(pHalSmbus);
    }
    else if ((pHalSmbus->u32State & HAL_SMBUS_STAT_MASTER_SLAVE_MASK) == HAL_SMBUS_STAT_SLAVE_BUSY_RX)
    {
        (void)SMBUSSlaveISR(pHalSmbus);
    }
}

/**
 * @defgroup HAL_SMBus_Global_Functions HAL SMBus Global Functions
 * @{
 */

/**
 * @brief Initialize the SMBUS according to the specified parameters
 *        in the stc_hal_smbus_init_t and initialize the associated handle.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_Init(stc_hal_smbus_handle_t *pHalSmbus)
{
    /* Check the SMBUS handle allocation */

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

    DDL_ASSERT(IS_SMBUS_PERIPH_MD(pHalSmbus->stcInit.u32PeriphMode));

    if (pHalSmbus->u32State == HAL_SMBUS_STAT_RST)
    {
        /* Allocate lock resource and initialize it */
        pHalSmbus->u8Lock = HAL_UNLOCKED;

        /* Init the low level hardware : GPIO, CLOCK, NVIC */
        HAL_SMBUS_MspInit(pHalSmbus);
    }

    pHalSmbus->u32State = HAL_SMBUS_STAT_BUSY;

    /* Disable the selected SMBUS peripheral */
    I2C_Cmd(pHalSmbus->I2Cx, DISABLE);

    if (LL_OK != I2C_BaudInit(pHalSmbus->I2Cx, pHalSmbus->stcInit.u32Baudrate))
    {
        return HAL_ERR;
    }

    I2C_AnalogFilterCmd(pHalSmbus->I2Cx, pHalSmbus->stcInit.enAnalogFilter);

    I2C_SlaveAddrCmd(pHalSmbus->I2Cx, I2C_ADDR0, DISABLE);

    if (0UL != pHalSmbus->stcInit.u32OwnAddr1)
    {
        I2C_SlaveAddrConfig(pHalSmbus->I2Cx, I2C_ADDR0, pHalSmbus->stcInit.u32AddrMode, pHalSmbus->stcInit.u32OwnAddr1);
        I2C_SlaveAddrCmd(pHalSmbus->I2Cx, I2C_ADDR0, ENABLE);
    }

    if (    (HAL_SMBUS_DUAL_ADDR_ENABLE == pHalSmbus->stcInit.u32DualAddrMode)
         && (0UL != pHalSmbus->stcInit.u32OwnAddr2))
    {
        I2C_SlaveAddrConfig(pHalSmbus->I2Cx, I2C_ADDR1, pHalSmbus->stcInit.u32AddrMode, pHalSmbus->stcInit.u32OwnAddr2);
        I2C_SlaveAddrMaskConfig(pHalSmbus->I2Cx,
                                I2C_ADDR1,
                                pHalSmbus->stcInit.u32AddrMode,
                                pHalSmbus->stcInit.u32OwnAddr2Masks);
        I2C_SlaveMaskAddrCmd(pHalSmbus->I2Cx, I2C_ADDR1, ENABLE);
        I2C_SlaveAddrCmd(pHalSmbus->I2Cx, I2C_ADDR1, ENABLE);
    }

    /* General call function config and interrupt enable */
    I2C_GeneralCallCmd(pHalSmbus->I2Cx, pHalSmbus->stcInit.enGeneralCall);

    if (ENABLE == pHalSmbus->stcInit.enGeneralCall)
    {
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_GENERAL_CALL, ENABLE);
    }

    /* SMBUS address config and interrupt enable */

    if (0UL != pHalSmbus->stcInit.u32PeriphMode)
    {
        I2C_SmbusMatchAddrCmd(pHalSmbus->I2Cx, pHalSmbus->stcInit.u32PeriphMode, ENABLE);

        if (0UL != (pHalSmbus->stcInit.u32PeriphMode & I2C_SMBUS_MATCH_DEFAULT))
        {
            I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_SMBUS_DEFAULT_MATCH, ENABLE);
        }

        if (0UL != (pHalSmbus->stcInit.u32PeriphMode & I2C_SMBUS_MATCH_HOST))
        {
            I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_SMBUS_HOST_MATCH, ENABLE);
        }
        I2C_SmbusCmd(pHalSmbus->I2Cx, ENABLE);
    }

    /* Timeout */

    if (pHalSmbus->stcInit.u32SMBusTimeout != 0U)
    {
        pHalSmbus->u32TimeoutCnt = 0U;
        I2C_TimeoutClkDiv(pHalSmbus->I2Cx, I2C_TIMEOUT_CLK_DIV4);
        I2C_SCLTimeoutSumCmd(pHalSmbus->I2Cx, DISABLE);

        I2C_SCLTimeoutAConfig(pHalSmbus->I2Cx, (uint16_t)(I2C_SRC_CLK / (1UL << I2C_TIMEOUT_CLK_DIV4) / 10000UL)); /* Count for 0.1mS */
        I2C_SCLLowTimeoutCmd(pHalSmbus->I2Cx, ENABLE);
        I2C_SCLTimeoutCmd(pHalSmbus->I2Cx, ENABLE);
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TMOUTIE, ENABLE);
    }
    else
    {
        I2C_SCLTimeoutAConfig(pHalSmbus->I2Cx, 0U);
        I2C_SCLLowTimeoutCmd(pHalSmbus->I2Cx, DISABLE);
        I2C_SCLTimeoutCmd(pHalSmbus->I2Cx, DISABLE);
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TMOUTIE, DISABLE);
    }

    /* Enable arbitration interrupt */
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_ARBITRATE_FAIL, ENABLE);
    /* Enable PEC calculate */
    I2C_SmbusNBConfig(pHalSmbus->I2Cx, I2C_SMBUS_PEC, ENABLE);
    I2C_MasterReadAddrIntCmd(pHalSmbus->I2Cx, ENABLE);

#ifdef SMBUS_ALERT
    /* Enable alert function for host */

    if (0UL != (pHalSmbus->stcInit.u32PeriphMode & I2C_SMBUS_MATCH_HOST))
    {
        I2C_SmbusAlertPinCmd(pHalSmbus->I2Cx, ENABLE);
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_SMBALERT_PIN, ENABLE);
    }
#endif

    I2C_Cmd(pHalSmbus->I2Cx, ENABLE);

    pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;
    pHalSmbus->u32State     = HAL_SMBUS_STAT_RDY;
    pHalSmbus->u32ComState  = SMBUS_I2C_STAT_IDLE;

    return HAL_OK;
}

/**
 * @brief DeInitialize the SMBUS peripheral.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_DeInit(stc_hal_smbus_handle_t *pHalSmbus)
{
    /* Check the SMBUS handle allocation */

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

    pHalSmbus->u32State = HAL_SMBUS_STAT_BUSY;

    /* Disable the SMBUS Peripheral Clock */
    I2C_Cmd(pHalSmbus->I2Cx, DISABLE);

    /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
    HAL_SMBUS_MspDeInit(pHalSmbus);

    pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;
    pHalSmbus->u32State     = HAL_SMBUS_STAT_RST;

    /* Release Lock */
    __HAL_UNLOCK(pHalSmbus);

    return HAL_OK;
}

/**
 * @brief Initialize the SMBUS MSP.
 * @param [in] pHalSmbus  Pointer to a HAL SMBUS handle structure
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_MspInit(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief DeInitialize the SMBUS MSP.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_MspDeInit(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief Transmit in master/host SMBUS mode an amount of data with Interrupt.
 * @param [in] pHalSmbus       Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @param [in] u16DevAddr      Target device address: The device 7 bits address value
 * @param [in] pData           Pointer to data buffer
 * @param [in] u16Size         Amount of data to be sent
 * @param [in] u32XferOption   Options of Transfer, value of @ref HAL_SMBUS_Xfer_Option,
 *        SMBUS_FRAME_PEC bit is valid for PEC data transmission.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_MasterTransmitIT(stc_hal_smbus_handle_t *pHalSmbus,
                                   uint16_t u16DevAddr,
                                   uint8_t *pData,
                                   uint16_t u16Size,
                                   uint32_t u32XferOption)
{
    uint16_t u16XferSizeLimit;
    /* Check the parameters */
    DDL_ASSERT(IS_SMBUS_XFER_OPT(u32XferOption));

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL)
         || (    (u16Size != 0U)
              && (pData == NULL)))
    {
        return HAL_ERR;
    }

    if (pHalSmbus->u32State == HAL_SMBUS_STAT_RDY)
    {
        /* Process Locked */
        __HAL_LOCK(pHalSmbus);

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
        {
            /* Have PEC BYTE */
            u16XferSizeLimit = MAX_NBYTE_SIZE + 1U;
        }
        else
        {
            u16XferSizeLimit = MAX_NBYTE_SIZE;
        }

        pHalSmbus->u32State     = HAL_SMBUS_STAT_MASTER_BUSY_TX;
        pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;
        /* Prepare transfer parameters */
        pHalSmbus->pBuf         = pData;
        pHalSmbus->u16DataIndex = 0U;

        if (u16XferSizeLimit < u16Size)
        {
            pHalSmbus->u16XferSize = u16XferSizeLimit;
        }
        else
        {
            pHalSmbus->u16XferSize = u16Size;
        }
        pHalSmbus->u32XferOption = u32XferOption;
        pHalSmbus->u16DevAddr    = u16DevAddr;
        pHalSmbus->u32TimeoutCnt = 0U;

        /* NBYTE config */
        I2C_SetNByte(pHalSmbus->I2Cx, (uint8_t)pHalSmbus->u16XferSize);
        I2C_SmbusNBConfig(pHalSmbus->I2Cx, I2C_SMBUS_NBYTE, ENABLE);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);

        /* Enable START interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_START, ENABLE);

