MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_START))
        {
            /* Generate start signal */
            pHalSmbus->u32ComState = SMBUS_I2C_STAT_START;
            I2C_GenerateStart(pHalSmbus->I2Cx);
        }
        else
        {
            /* Generate Restart signal */
            pHalSmbus->u32ComState = SMBUS_I2C_STAT_RESTART;
            I2C_GenerateRestart(pHalSmbus->I2Cx);
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief Receive in master/host SMBUS mode an amount of data with Interrupt.
 * @param [in] pHalSmbus       Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @param [in] u16DevAddr      Target device address: The device 7 bits address value
 * @param [in] pData           Pointer to data buffer
 * @param [in] u16Size         Amount of data to be receive
 * @param [in] u32XferOption   Options of Transfer, value of @ref HAL_SMBUS_Xfer_Option,
 *        SMBUS_FRAME_PEC bit is valid for PEC data transmission.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_MasterReceiveIT(stc_hal_smbus_handle_t *pHalSmbus,
                                  uint16_t u16DevAddr,
                                  uint8_t *pData,
                                  uint16_t u16Size,
                                  uint32_t u32XferOption)
{
    uint16_t u16XferSizeLimit;
    /* Check the parameters */
    DDL_ASSERT(IS_SMBUS_XFER_OPT(u32XferOption));

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL)
         || (    (u16Size != 0U)
              && (pData == NULL)))
    {
        return HAL_ERR;
    }

    if (pHalSmbus->u32State == HAL_SMBUS_STAT_RDY)
    {
        /* Process Locked */
        __HAL_LOCK(pHalSmbus);

        pHalSmbus->u32State = HAL_SMBUS_STAT_MASTER_BUSY_RX;

        pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
        {
            /* Have PEC BYTE */
            u16XferSizeLimit = MAX_NBYTE_SIZE + 1U;
        }
        else
        {
            u16XferSizeLimit = MAX_NBYTE_SIZE;
        }
        /* Prepare transfer parameters */
        pHalSmbus->pBuf         = pData;
        pHalSmbus->u16DataIndex = 0U;

        if (u16XferSizeLimit < u16Size)
        {
            pHalSmbus->u16XferSize = u16XferSizeLimit;
        }
        else
        {
            pHalSmbus->u16XferSize = u16Size;
        }
        pHalSmbus->u32XferOption = u32XferOption;
        pHalSmbus->u16DevAddr    = u16DevAddr;
        pHalSmbus->u32TimeoutCnt = 0U;

        /* NBYTE config */
        I2C_SetNByte(pHalSmbus->I2Cx, (uint8_t)pHalSmbus->u16XferSize);
        I2C_SmbusNBConfig(pHalSmbus->I2Cx, I2C_SMBUS_NBYTE | I2C_SMBUS_AUTONAK, ENABLE);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_START))
        {
            /* Enable START interrupt */
            I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_START, ENABLE);
            /* Generate start signal */
            pHalSmbus->u32ComState = SMBUS_I2C_STAT_START;
            I2C_GenerateStart(pHalSmbus->I2Cx);
        }
        else
        {
            /* Generate Restart signal */
            pHalSmbus->u32ComState = SMBUS_I2C_STAT_RESTART;
            I2C_GenerateRestart(pHalSmbus->I2Cx);
        }

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief Transmit in slave/device SMBUS mode an amount of data in non-blocking mode with Interrupt.
 * @param [in] pHalSmbus       Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @param [in] pData           Pointer to data buffer
 * @param [in] u16Size         Amount of data to be sent
 * @param [in] u32XferOption   Options of Transfer, value of @ref HAL_SMBUS_Xfer_Option,
 *        SMBUS_FRAME_PEC bit is valid for PEC data transmission.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_SlaveTransmitIT(stc_hal_smbus_handle_t *pHalSmbus,
                                  uint8_t *pData,
                                  uint16_t u16Size,
                                  uint32_t u32XferOption)
{
    uint8_t u8Data;
    uint16_t u16XferSizeLimit;
    /* Check the parameters */
    DDL_ASSERT(IS_SMBUS_XFER_OPT(u32XferOption));

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL)
         || (    (u16Size != 0U)
              && (pData == NULL)))
    {
        return HAL_ERR;
    }

    if ((pHalSmbus->u32State & HAL_SMBUS_STAT_LISTEN) == HAL_SMBUS_STAT_LISTEN)
    {
        if (    (pData == NULL)
             || (u16Size == 0U))
        {
            return HAL_ERR;
        }

        /* Disable Interrupts, to prevent preemption during treatment in case of multicall */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | SMBUS_INT_SLAVE_TX, DISABLE);

        /* Process Locked */
        __HAL_LOCK(pHalSmbus);

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
        {
            /* Have PEC BYTE */
            u16XferSizeLimit = MAX_NBYTE_SIZE + 1U;
        }
        else
        {
            u16XferSizeLimit = MAX_NBYTE_SIZE;
        }
        pHalSmbus->u32State     = (HAL_SMBUS_STAT_SLAVE_BUSY_TX | HAL_SMBUS_STAT_LISTEN);
        pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;
        /* Prepare transfer parameters */
        pHalSmbus->pBuf = pData;

        if (u16XferSizeLimit < u16Size)
        {
            pHalSmbus->u16XferSize = u16XferSizeLimit;
        }
        else
        {
            pHalSmbus->u16XferSize = u16Size;
        }
        pHalSmbus->u32XferOption = u32XferOption;
        pHalSmbus->u16DataIndex  = 0U;

        I2C_AckConfig(pHalSmbus->I2Cx, I2C_ACK);

        /* Clear ADDR flag after prepare the transfer parameters */
        /* This action will generate an acknowledge to the HOST */
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_MATCH_ADDR0);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);

        /* REnable ADDR interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | SMBUS_INT_SLAVE_TX, ENABLE);

        /* Send first data */

        if ((0UL != pHalSmbus->u16XferSize))
        {
            u8Data = *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex);
            I2C_WriteData(pHalSmbus->I2Cx, u8Data);
            pHalSmbus->u16DataIndex++;
        }

        return HAL_OK;
    }
    else
    {
        return HAL_ERR;
    }
}

/**
 * @brief Receive in slave/device SMBUS mode an amount of data in non-blocking mode with Interrupt.
 * @param [in] pHalSmbus       Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @param [in] pData           Pointer to data buffer
 * @param [in] u16Size         Amount of data to be sent
 * @param [in] u32XferOption   Options of Transfer, value of @ref HAL_SMBUS_Xfer_Option,
 *        SMBUS_FRAME_PEC bit is valid for PEC data transmission.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_SlaveReceiveIT(stc_hal_smbus_handle_t *pHalSmbus,
                                 uint8_t *pData,
                                 uint16_t u16Size,
                                 uint32_t u32XferOption)
{
    uint8_t u8Data;
    uint16_t u16XferSizeLimit;
    /* Check the parameters */
    DDL_ASSERT(IS_SMBUS_XFER_OPT(u32XferOption));

    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL)
         || (    (u16Size != 0U)
              && (pData == NULL)))
    {
        return HAL_ERR;
    }

    if ((pHalSmbus->u32State & HAL_SMBUS_STAT_LISTEN) == HAL_SMBUS_STAT_LISTEN)
    {
        if (    (pData == NULL)
             || (u16Size == 0U))
        {
            return HAL_ERR;
        }

        /* Disable Interrupts, to prevent preemption during treatment in case of multi-call */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0, DISABLE);
        /* Process Locked */
        __HAL_LOCK(pHalSmbus);

        pHalSmbus->u32State     = (HAL_SMBUS_STAT_SLAVE_BUSY_RX | HAL_SMBUS_STAT_LISTEN);
        pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_NONE;

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
        {
            /* Have PEC BYTE */
            u16XferSizeLimit = MAX_NBYTE_SIZE + 1U;
        }
        else
        {
            u16XferSizeLimit = MAX_NBYTE_SIZE;
        }
        /* Prepare transfer parameters */
        pHalSmbus->pBuf = pData;

        if (u16XferSizeLimit < u16Size)
        {
            pHalSmbus->u16XferSize = u16XferSizeLimit;
        }
        else
        {
            pHalSmbus->u16XferSize = u16Size;
        }
        pHalSmbus->u32XferOption = u32XferOption;
        pHalSmbus->u16DataIndex  = 0U;

        /* Clear ADDR flag after prepare the transfer parameters */
        /* This action will generate an acknowledge to the HOST */
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_MATCH_ADDR0);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        /* Enable ADDR interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | SMBUS_INT_SLAVE_RX, ENABLE);

        /* Master should send first data after address matched with interrupt. So should read first data here */

        if (    (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_RX_FULL))
             && (0UL < pHalSmbus->u16XferSize))
        {
            u8Data                                       = I2C_ReadData(pHalSmbus->I2Cx);
            *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex) = u8Data;
            pHalSmbus->u16DataIndex++;
        }
        return HAL_OK;
    }
    else
    {
        return HAL_ERR;
    }
}

/**
 * @brief Enable the Address listen mode with Interrupt.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_EnableListenIT(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

    pHalSmbus->u32State = HAL_SMBUS_STAT_LISTEN;

    /* Enable the Address Match interrupt */
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | I2C_INT_NACK, ENABLE);

    return HAL_OK;
}

/**
 * @brief Disable the Address listen mode with Interrupt.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_DisableListenIT(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

    /* Disable Address listen mode only if a transfer is not ongoing */

    if (pHalSmbus->u32State == HAL_SMBUS_STAT_LISTEN)
    {
        pHalSmbus->u32State = HAL_SMBUS_STAT_RDY;

        /* Disable the Address Match interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | I2C_INT_NACK, DISABLE);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief Enable the SMBUS alert mode with Interrupt.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUSx peripheral.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_EnableAlertIT(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

    /* Enable SMBus alert */
    I2C_SmbusMatchAddrCmd(pHalSmbus->I2Cx, I2C_SMBUS_MATCH_ALERT, ENABLE);

    /* Clear ALERT flag */
    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_SMBUS_ALERT_MATCH);

    /* Enable Alert Interrupt */
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_SMBUS_ALERT_MATCH, ENABLE);

    return HAL_OK;
}

/**
 * @brief Disable the SMBUS alert mode with Interrupt.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUSx peripheral.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
int32_t HAL_SMBUS_DisableAlertIT(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (    (pHalSmbus == NULL)
         || (pHalSmbus->I2Cx == NULL))
    {
        return HAL_ERR;
    }

