MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
    /* Disable Alert Interrupt */
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_SMBUS_ALERT_MATCH, DISABLE);

    return HAL_OK;
}

/**
 * @brief Master Tx Transfer completed callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_MasterTxCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief Master Rx Transfer completed callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_MasterRxCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/** @brief Slave Tx Transfer completed callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_SlaveTxCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief Slave Rx Transfer completed callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_SlaveRxCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief Slave Address Match callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @param [in] u8XferDir   Master request Transfer Direction @ref HAL_SMBUS_Slave_Dir
 * @param [in] u16AddrMatchCode Address Match Code
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_AddrCallback(stc_hal_smbus_handle_t *pHalSmbus, uint8_t u8XferDir, uint16_t u16AddrMatchCode)
{
    (void)(pHalSmbus);
    (void)(u8XferDir);
    (void)(u16AddrMatchCode);
}

/**
 * @brief Listen Complete callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_ListenCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @brief SMBUS error callback.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
__WEAKDEF void HAL_SMBUS_ErrorCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    (void)(pHalSmbus);
}

/**
 * @}
 */

/**
 * @addtogroup HAL_SMBus_Private_Functions HAL SMBus Private Functions
 * @{
 */

/**
 * @brief Initialize the I2C baudrate.
 * @param [in] I2Cx                 Pointer to I2C instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_I2C or CM_I2Cx:  I2C instance register base.
 * @param [in] u32Baudrate          The target SMBUS communication baudrate.
 * @retval int32_t
 *         - LL_OK:                 Success
 *         - LL_ERR_TIMEOUT:        Failed
 *         - LL_ERR_INVD_PARAM:     Parameter error
 */
static int32_t I2C_BaudInit(CM_I2C_TypeDef *I2Cx, uint32_t u32Baudrate)
{
    int32_t i32Ret;
    float32_t fErr;
    stc_i2c_init_t stcI2cInit;
    uint32_t I2cSrcClk;
    uint32_t I2cClkDiv;
    uint32_t I2cClkDivReg;

    DDL_ASSERT(u32Baudrate != 0UL);
    I2cSrcClk = I2C_SRC_CLK;
    I2cClkDiv = I2cSrcClk / u32Baudrate / I2C_WIDTH_MAX_IMME;

    for (I2cClkDivReg = I2C_CLK_DIV1; I2cClkDivReg <= I2C_CLK_DIV128; I2cClkDivReg++)
    {
        if (I2cClkDiv < (1UL << I2cClkDivReg))
        {
            break;
        }
    }

    (void)I2C_StructInit(&stcI2cInit);
    stcI2cInit.u32Baudrate = u32Baudrate;
    stcI2cInit.u32SclTime = (uint32_t)((uint64_t)250UL * ((uint64_t)I2cSrcClk / ((uint64_t)1UL << I2cClkDivReg))
                                       / (uint64_t)(1UL * 1000UL * 1000UL * 1000UL)); /* SCL time is about 250nS in EVB board */
    stcI2cInit.u32ClockDiv = I2cClkDivReg;
    i32Ret = I2C_Init(I2Cx, &stcI2cInit, &fErr);

    if (LL_OK == i32Ret)
    {
        I2C_BusWaitCmd(I2Cx, ENABLE);
    }

    return i32Ret;
}

/**
 * @brief I2C interrupt configuration status get.
 * @param [in] I2Cx                 Pointer to I2C instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_I2C or CM_I2Cx:  I2C instance register base.
 * @param [in] u32IntType           Specifies the I2C interrupts @ref I2C_Int_Flag
 * @retval An @ref en_flag_status_t enumeration type value
 */
static en_flag_status_t I2C_IntStdGet(CM_I2C_TypeDef *I2Cx, uint32_t u32IntType)
{
    if ((I2Cx->CR2 & u32IntType) != 0UL)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
 * @brief I2C current marching address
 * @param [in] I2Cx                 Pointer to I2C instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_I2C or CM_I2Cx:  I2C instance register base.
 * @retval uint32_t                 The Address
 */
static uint32_t I2C_GetAddr(CM_I2C_TypeDef *I2Cx)
{
    return (READ_REG32(I2Cx->SLVADDR) & I2C_SLVADDR_SLVADR);
}

/**
 * @brief Master NACK interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterNackHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_NACK);

    /* Check that SMBUS transfer finished */

    if (pHalSmbus->u16DataIndex == pHalSmbus->u16XferSize)
    {
        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
    }
    else
    {
        /* Data transfer not finish, receive NACK, error */
        pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_ACKF;

        /* Enter stop stage */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_STOP, ENABLE);
        /* Generate stop condition */
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_STOP;
        I2C_GenerateStop(pHalSmbus->I2Cx);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);

        /* Call the Error callback to inform upper layer */
        HAL_SMBUS_ErrorCallback(pHalSmbus);
    }
}

static void MasterTansCpltCallback(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (pHalSmbus->u32State == HAL_SMBUS_STAT_MASTER_BUSY_TX)
    {
        pHalSmbus->u32State    = HAL_SMBUS_STAT_RDY;
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_IDLE;
        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        HAL_SMBUS_MasterTxCpltCallback(pHalSmbus);
    }
    else if (pHalSmbus->u32State == HAL_SMBUS_STAT_MASTER_BUSY_RX)
    {
        pHalSmbus->u32State    = HAL_SMBUS_STAT_RDY;
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_IDLE;
        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        HAL_SMBUS_MasterRxCpltCallback(pHalSmbus);
    }
}

/**
 * @brief Master transfer or receive finish process
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterDataFinish(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_STOP))
    {
        /* Enter stop stage */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_STOP, ENABLE);
        /* Generate stop condition */
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_STOP;
        I2C_GenerateStop(pHalSmbus->I2Cx);
    }
    else
    {
        MasterTansCpltCallback(pHalSmbus);
    }
}

/**
 * @brief Master receive the last data
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterRxLastData(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint8_t u8Data;

    if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
    {
        if (pHalSmbus->stcInit.enPacketErrorCheck == ENABLE)
        {
            /* Read PEC */
            pHalSmbus->u8Crc8Rev = I2C_ReadData(pHalSmbus->I2Cx);

            if (pHalSmbus->u8Crc8Rev != pHalSmbus->u8Crc8)
            {
                pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_PECERR;
                HAL_Printf("HAL_SMBUS_ErrorCallback\r\n");
                HAL_SMBUS_ErrorCallback(pHalSmbus);
            }
        }
    }
    else
    {
        /* Read last normal data */
        u8Data                                       = I2C_ReadData(pHalSmbus->I2Cx);
        *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex) = u8Data;
        pHalSmbus->u16DataIndex++;
    }
}

/**
 * @brief Master stop interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterStopHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    I2C_SmbusNBConfig(pHalSmbus->I2Cx, I2C_SMBUS_NBYTE | I2C_SMBUS_AUTONAK, DISABLE);
    /* Disable Stop flag interrupt */
    I2C_IntCmd(pHalSmbus->I2Cx,
               I2C_INT_TX_EMPTY | I2C_INT_RX_FULL | I2C_INT_TX_CPLT | I2C_INT_STOP | I2C_INT_NACK | I2C_INT_START,
               DISABLE);

    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_STOP);

    if (pHalSmbus->u32ErrorCode == HAL_SMBUS_ERR_ACKF)
    {
        pHalSmbus->u32State    = HAL_SMBUS_STAT_RDY;
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_IDLE;

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
    }
    else
    {
        MasterTansCpltCallback(pHalSmbus);
    }

    pHalSmbus->u32TimeoutCnt = 0U;
}

/**
 * @brief Master start interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterStartHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint8_t u8AddrTemp = 0U;

    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_START | I2C_FLAG_CLR_NACK);
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_STOP | I2C_INT_NACK, ENABLE);
    /* Enable TEI interrupt which indicate address transfer end */
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_CPLT, ENABLE);

    if (pHalSmbus->u32State == HAL_SMBUS_STAT_MASTER_BUSY_TX)
    {
        /* Enter data tx stage */
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_ADDR_TX;
        u8AddrTemp = ((uint8_t)(pHalSmbus->u16DevAddr << 1U) | I2C_DIR_TX);
    }
    else if (pHalSmbus->u32State == HAL_SMBUS_STAT_MASTER_BUSY_RX)
    {
        /* Enter data rx stage */
        pHalSmbus->u32ComState = SMBUS_I2C_STAT_ADDR_RX;
        u8AddrTemp = ((uint8_t)(pHalSmbus->u16DevAddr << 1U) | I2C_DIR_RX);
    }
    pHalSmbus->u16DataIndex = 0U;

    I2C_WriteData(pHalSmbus->I2Cx, u8AddrTemp);
}

/**
 * @brief Master receive full interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterReceiveDataHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (pHalSmbus->u16DataIndex == (pHalSmbus->u16XferSize - 1U))
    {
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_RX_FULL, DISABLE);
        /* Read last data */
        MasterRxLastData(pHalSmbus);

        MasterDataFinish(pHalSmbus);
    }
    else
    {
        *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex) = I2C_ReadData(pHalSmbus->I2Cx);
        pHalSmbus->u16DataIndex++;
        pHalSmbus->u8Crc8 = I2C_GetPECValue(pHalSmbus->I2Cx);
    }
}

/**
 * @brief Master transfer empty interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterTxEmptyHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if (pHalSmbus->u16DataIndex < (pHalSmbus->u16XferSize - 1U))
    {
        I2C_WriteData(pHalSmbus->I2Cx, *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex));
        pHalSmbus->u16DataIndex++;
    }
    else if (pHalSmbus->u16DataIndex == (pHalSmbus->u16XferSize - 1U))
    {
        /* Last data */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_EMPTY, DISABLE);
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_CPLT, ENABLE);

        if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
        {
            if (pHalSmbus->stcInit.enPacketErrorCheck == ENABLE)
            {
                /* Wait TX CPLT */

