MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
                while (I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_TX_CPLT) == RESET)
                {
                    /* Wait */
                }
                pHalSmbus->u8Crc8 = I2C_GetPECValue(pHalSmbus->I2Cx);
                /* Send PEC */
                I2C_WriteData(pHalSmbus->I2Cx, pHalSmbus->u8Crc8);
                pHalSmbus->u16DataIndex++;
            }
        }
        else
        {
            I2C_WriteData(pHalSmbus->I2Cx, *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex));
            pHalSmbus->u16DataIndex++;
        }
    }
    else
    {
        /* do not have data trasfer */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_EMPTY, DISABLE);
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_CPLT, ENABLE);
    }
}

/**
 * @brief Master transfer complete interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void MasterTxCompleteHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_CPLT, DISABLE);

    if (    (SMBUS_I2C_STAT_ADDR_TX == pHalSmbus->u32ComState)
         && (pHalSmbus->u16DataIndex == 0U))
    {
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_TX_CPLT);
        /* Address send finished, Data TX */

        if (pHalSmbus->u16XferSize == 0UL)
        {
            /* Have no data transfer, enter stop stage */
            MasterDataFinish(pHalSmbus);
        }
        else
        {
            /* If Address send receive ACK */

            if (RESET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_ACKR))
            {
                pHalSmbus->u32ComState = SMBUS_I2C_STAT_TX;
                /* Config tx buffer empty interrupt function */
                I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_EMPTY, ENABLE);
                /* Transfer first data here */
                I2C_WriteData(pHalSmbus->I2Cx, *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex));
                pHalSmbus->u16DataIndex++;
            }
        }
    }
    else if (    (SMBUS_I2C_STAT_ADDR_RX == pHalSmbus->u32ComState)
              && (pHalSmbus->u16DataIndex == 0U))
    {
        /* Address send finished, Data RX */

        if (pHalSmbus->u16XferSize == 0UL)
        {
            /* Have no data receive, enter stop stage */
            MasterDataFinish(pHalSmbus);
        }
        else
        {
            /* If Address send receive ACK */

            if (RESET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_ACKR))
            {
                I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_RX_FULL, ENABLE);
                pHalSmbus->u32ComState = SMBUS_I2C_STAT_RX;
                I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_TX_CPLT);
            }
        }
    }
    else
    {
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_TX_CPLT);
        /* Data Tx finish */
        MasterDataFinish(pHalSmbus);
    }
}

/**
 * @brief Interrupt Sub-Routine which handle the Interrupt Flags Master Mode.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
static int32_t SMBUSMasterISR(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint32_t u32Status;
    /* Process Locked */
    __HAL_LOCK(pHalSmbus);

    u32Status = pHalSmbus->I2Cx->SR;

    if (    (0UL != (u32Status & I2C_FLAG_NACKF))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_NACK)))
    {
        /* Master NACK interrupt */
        HAL_Printf("MasterNackHandler\r\n");
        MasterNackHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_STOP))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_STOP)))
    {
        /* Master STOP interrupt */
        HAL_Printf("MasterStopHandler\r\n");
        MasterStopHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_START))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_START)))
    {
        /* Master START interrupt */
        HAL_Printf("MasterStartHandler\r\n");
        MasterStartHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_RX_FULL))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_RX_FULL)))
    {
        /* Master RXI interrupt */
        HAL_Printf("MasterReceiveDataHandler\r\n");
        MasterReceiveDataHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_TX_EMPTY))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_TX_EMPTY)))
    {
        /* Master TXI interrupt */
        HAL_Printf("MasterTxEmptyHandler\r\n");
        MasterTxEmptyHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_TX_CPLT))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_TX_CPLT)))
    {
        /* Master TCI interrupt */
        HAL_Printf("MasterTxCompleteHandler\r\n");
        MasterTxCompleteHandler(pHalSmbus);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(pHalSmbus);
    return HAL_OK;
}

/**
 * @brief Slave NACK interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void SlaveNackHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_NACK);

    /* Check that SMBUS transfer finished */

    if (pHalSmbus->u16DataIndex == pHalSmbus->u16XferSize)
    {
        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
    }
    else
    {
        /* So reset Slave Busy state */
        pHalSmbus->u32State &= ~((uint32_t)HAL_SMBUS_STAT_SLAVE_BUSY_TX);
        pHalSmbus->u32State &= ~((uint32_t)HAL_SMBUS_STAT_SLAVE_BUSY_RX);

        /* Disable RX/TX Interrupts, keep only ADDR Interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, SMBUS_INT_SLAVE_TX | SMBUS_INT_SLAVE_RX, DISABLE);

        /* Set ErrorCode corresponding to a Non-Acknowledge */
        pHalSmbus->u32ErrorCode |= HAL_SMBUS_ERR_ACKF;

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);

        /* Call the Error callback to inform upper layer */
        HAL_SMBUS_ErrorCallback(pHalSmbus);
    }
}

/**
 * @brief Slave address matched interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void SlaveAddrHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint8_t u8XferDir;
    uint32_t AddrTmp = I2C_GetAddr(pHalSmbus->I2Cx);

