MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
    if (SET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_TRA))
    {
        u8XferDir = HAL_SMBUS_SLAVE_DIR_TX;
    }
    else
    {
        u8XferDir = HAL_SMBUS_SLAVE_DIR_RX;
    }

    I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0, DISABLE);

    /* Process Unlocked */
    __HAL_UNLOCK(pHalSmbus);

    HAL_SMBUS_AddrCallback(pHalSmbus, u8XferDir, (uint16_t)AddrTmp);

    pHalSmbus->u32TimeoutCnt = 0U;
}

/**
 * @brief Slave transfer complete interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void SlaveTxCompleteHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_TX_CPLT);

    if (pHalSmbus->u16DataIndex == pHalSmbus->u16XferSize)
    {
        /* Remove HAL_SMBUS_STAT_SLAVE_BUSY_TX, keep only HAL_SMBUS_STAT_LISTEN */
        I2C_IntCmd(pHalSmbus->I2Cx, I2C_INT_TX_CPLT, DISABLE);
        pHalSmbus->u32State &= ~((uint32_t)HAL_SMBUS_STAT_SLAVE_BUSY_TX);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        /* Call the Tx complete callback to inform upper layer of the end of transmit process */
        HAL_SMBUS_SlaveTxCpltCallback(pHalSmbus);
    }
    else
    {
        if (RESET == I2C_GetStatus(pHalSmbus->I2Cx, I2C_FLAG_ACKR))
        {
            if (    (pHalSmbus->u16DataIndex == (pHalSmbus->u16XferSize - 1U))
                 && (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC)))
            {
                if (pHalSmbus->stcInit.enPacketErrorCheck == ENABLE)
                {
                    pHalSmbus->u8Crc8 = I2C_GetPECValue(pHalSmbus->I2Cx);
                    /* last data is PEC */
                    I2C_WriteData(pHalSmbus->I2Cx, pHalSmbus->u8Crc8);
                    pHalSmbus->u16DataIndex++;
                }
            }
            else
            {
                I2C_WriteData(pHalSmbus->I2Cx, *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex));
                pHalSmbus->u16DataIndex++;
            }
        }
    }
}

/**
 * @brief Slave receive full interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void SlaveReceiveDataHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint8_t u8Data;

    if (pHalSmbus->u16DataIndex <= (pHalSmbus->u16XferSize - 1U))
    {
        /* Read one data */
        u8Data = I2C_ReadData(pHalSmbus->I2Cx);

        if (pHalSmbus->u16DataIndex == (pHalSmbus->u16XferSize - 1U))
        {
            /* Last data */

            if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
            {
                if (pHalSmbus->stcInit.enPacketErrorCheck == ENABLE)
                {
                    pHalSmbus->u8Crc8Rev = u8Data;
                    /* The last data is PEC */

                    if (u8Data != pHalSmbus->u8Crc8)
                    {
                        HAL_Printf("slave pec error\r\n");
                        pHalSmbus->u32ErrorCode = HAL_SMBUS_ERR_PECERR;
                    }
                }
            }
            else
            {
                *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex) = u8Data;
                pHalSmbus->u8Crc8                            = I2C_GetPECValue(pHalSmbus->I2Cx);
            }
            pHalSmbus->u16DataIndex++;
            /* Last Byte is received, disable Interrupt */
            I2C_IntCmd(pHalSmbus->I2Cx, SMBUS_INT_SLAVE_RX, DISABLE);

            /* Remove HAL_SMBUS_STAT_SLAVE_BUSY_RX, keep only HAL_SMBUS_STAT_LISTEN */
            pHalSmbus->u32State &= ~((uint32_t)HAL_SMBUS_STAT_SLAVE_BUSY_RX);

            /* Process Unlocked */
            __HAL_UNLOCK(pHalSmbus);
            HAL_SMBUS_SlaveRxCpltCallback(pHalSmbus);
        }
        else
        {
            *(pHalSmbus->pBuf + pHalSmbus->u16DataIndex) = u8Data;
            pHalSmbus->u16DataIndex++;

            if (0UL != (pHalSmbus->u32XferOption & SMBUS_FRAME_PEC))
            {
                pHalSmbus->u8Crc8 = I2C_GetPECValue(pHalSmbus->I2Cx);
            }
        }
    }
    else
    {
        /* Last Byte is received, disable Interrupt */
        I2C_IntCmd(pHalSmbus->I2Cx, SMBUS_INT_SLAVE_RX, DISABLE);

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        HAL_SMBUS_SlaveRxCpltCallback(pHalSmbus);
    }
}

/**
 * @brief Slave stop interrupt handler
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval None
 */
static void SlaveStopHandler(stc_hal_smbus_handle_t *pHalSmbus)
{
    if ((pHalSmbus->u32State & HAL_SMBUS_STAT_LISTEN) == HAL_SMBUS_STAT_LISTEN)
    {
        /* Disable RX and TX and ADDR vInterrupts */
        I2C_IntCmd(pHalSmbus->I2Cx,
                   SMBUS_INT_SLAVE_TX | SMBUS_INT_SLAVE_RX | I2C_INT_MATCH_ADDR0 | I2C_INT_STOP | I2C_INT_NACK,
                   DISABLE);
        I2C_AckConfig(pHalSmbus->I2Cx, I2C_ACK);

        /* Clear STOP and ADDR Flag */
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_STOP | I2C_FLAG_MATCH_ADDR0);

        pHalSmbus->u16DataIndex = 0U;
        pHalSmbus->u32State     = HAL_SMBUS_STAT_RDY;
        pHalSmbus->u32ComState  = SMBUS_I2C_STAT_IDLE;

        /* Process Unlocked */
        __HAL_UNLOCK(pHalSmbus);
        HAL_SMBUS_ListenCpltCallback(pHalSmbus);
    }
    pHalSmbus->u32TimeoutCnt = 0U;
}

/**
 * @brief Interrupt Sub-Routine which handle the Interrupt Flags Slave Mode.
 * @param [in] pHalSmbus   Pointer to a stc_hal_smbus_handle_t structure that contains
 *        the configuration information for the specified SMBUS.
 * @retval HAL status @ref HC32_Series_Hal_Status_Define
 */
static int32_t SMBUSSlaveISR(stc_hal_smbus_handle_t *pHalSmbus)
{
    uint32_t u32Status;
    /* Process Locked */
    __HAL_LOCK(pHalSmbus);

    u32Status = pHalSmbus->I2Cx->SR;

