MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_hal_smbus.c
    if (    (0UL != (u32Status & I2C_FLAG_TX_CPLT))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_TX_CPLT)))
    {
        HAL_Printf("SlaveTxCompleteHandler\r\n");
        /* Slave transfer complete interrupt */
        SlaveTxCompleteHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_MATCH_ADDR0))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_MATCH_ADDR0)))
    {
        HAL_Printf("SlaveAddrHandler\r\n");
        /* Slave address matched interrupt */
        SlaveAddrHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_GENERAL_CALL))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_GENERAL_CALL)))
    {
        HAL_Printf("SlaveAddrHandler_GENERAL_CALL\r\n");
        /* Slave address matched interrupt */
        SlaveAddrHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_SMBUS_DEFAULT_MATCH))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_SMBUS_DEFAULT_MATCH)))
    {
        HAL_Printf("SlaveAddrHandler_SMBUS_DEFAUL\r\n");
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_SMBUS_DEFAULT_MATCH);
        /* Slave address matched interrupt */
        SlaveAddrHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_SMBUS_HOST_MATCH))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_SMBUS_HOST_MATCH)))
    {
        HAL_Printf("SlaveAddrHandler_SMBUS_HOST\r\n");
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_SMBUS_HOST_MATCH);
        /* Slave address matched interrupt */
        SlaveAddrHandler(pHalSmbus);
    }
    else if (    (0UL != (u32Status & I2C_FLAG_SMBUS_ALERT_MATCH))
              && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_SMBUS_ALERT_MATCH)))
    {
        HAL_Printf("SlaveAddrHandler_SMBUS_ALERT\r\n");
        I2C_ClearStatus(pHalSmbus->I2Cx, I2C_FLAG_CLR_SMBUS_ALERT_MATCH);
        /* Slave address matched interrupt */
        SlaveAddrHandler(pHalSmbus);
    }

    u32Status = pHalSmbus->I2Cx->SR;

    if (    (0UL != (u32Status & I2C_FLAG_RX_FULL))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_RX_FULL)))
    {
        HAL_Printf("SlaveReceiveDataHandler\r\n");
        /* Slave receive full interrupt */
        SlaveReceiveDataHandler(pHalSmbus);
    }

    if (    (0UL != (u32Status & I2C_FLAG_NACKF))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_NACK)))
    {
        /* Slave NACK interrupt */
        HAL_Printf("SlaveNackHandler\r\n");
        SlaveNackHandler(pHalSmbus);
    }

    if (    (0UL != (u32Status & I2C_FLAG_STOP))
         && (SET == I2C_IntStdGet(pHalSmbus->I2Cx, I2C_INT_STOP)))
    {
        /* Slave STOP interrupt */
        HAL_Printf("SlaveStopHandler\r\n");
        SlaveStopHandler(pHalSmbus);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(pHalSmbus);
    return HAL_OK;
}

/**
 * @}
 */

#endif /* HAL_SMBUS_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
